; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	image5 - mode
	thermograph4 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	image3 - mode
	infrared2 - mode
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared2)
	(supports instrument2 image5)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument4 image3)
	(supports instrument4 thermograph4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument6 thermograph4)
	(supports instrument6 image3)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star1)
	(supports instrument8 thermograph4)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star4)
	(supports instrument9 thermograph4)
	(supports instrument9 image3)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite3 GroundStation6)
	(have_image Phenomenon7 thermograph4)
	(have_image Star8 image3)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 image5)
	(have_image Planet10 image5)
	(have_image Planet10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Star12 spectrograph1)
))

)

; plan
1. (turn_to satellite5 groundstation0 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument10 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument10)
   goals met: 0 of 10
3. (calibrate satellite5 instrument10 groundstation0)
   added: (calibrated instrument10)
   goals met: 0 of 10
4. (turn_to satellite5 planet10 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 planet10)
   goals met: 0 of 10
5. (turn_to satellite4 star2 groundstation5)
   deleted: (pointing satellite4 groundstation5)
   added: (pointing satellite4 star2)
   goals met: 0 of 10
6. (turn_to satellite3 groundstation6 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 groundstation6)
   goals met: 1 of 10
7. (turn_to satellite1 groundstation6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 10
8. (turn_to satellite0 phenomenon9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 10
9. (take_image satellite5 planet10 instrument10 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 10
10. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 3 of 10
11. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 10
12. (calibrate satellite4 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 3 of 10
13. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 3 of 10
14. (turn_to satellite1 phenomenon9 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 10
15. (take_image satellite1 phenomenon9 instrument2 image5)
   added: (have_image phenomenon9 image5)
   goals met: 4 of 10
16. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 4 of 10
17. (take_image satellite1 planet10 instrument2 image5)
   added: (have_image planet10 image5)
   goals met: 5 of 10
18. (turn_to satellite1 star8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star8)
   goals met: 5 of 10
19. (take_image satellite1 star8 instrument2 infrared2)
   added: (have_image star8 infrared2)
   goals met: 6 of 10
20. (turn_to satellite4 phenomenon7 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon7)
   goals met: 6 of 10
21. (take_image satellite4 phenomenon7 instrument9 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 7 of 10
22. (turn_to satellite4 star12 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star12)
   goals met: 7 of 10
23. (take_image satellite4 star12 instrument9 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 8 of 10
24. (turn_to satellite4 star8 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star8)
   goals met: 8 of 10
25. (take_image satellite4 star8 instrument9 image3)
   added: (have_image star8 image3)
   goals met: 9 of 10
26. (turn_to satellite5 star11 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 star11)
   goals met: 9 of 10
27. (take_image satellite5 star11 instrument10 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 10 of 10
